In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression
%matplotlib inline

In [2]:
df = pd.read_csv('hiring.csv')

In [4]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [9]:
median_val = df[['test_score(out of 10)']].median()
median_val

test_score(out of 10)    8.0
dtype: float64

In [11]:
df['test_score(out of 10)'] = df[['test_score(out of 10)']].fillna(median_val)

In [12]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [28]:
df['experience'] = df['experience'].fillna("zero")

In [29]:
from word2number import w2n
# w2n.word_to_num('eleven')
def convert_to_num(words):
    if words!="":
        return w2n.word_to_num(words)

In [30]:
df['experience'] = df['experience'].apply(convert_to_num)

In [31]:
df.head()

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000

In [32]:
X = df[['experience','test_score(out of 10)','interview_score(out of 10)']]
y = df[['salary($)']]

In [33]:
model = LinearRegression()
model.fit(X,y)

LinearRegression()

In [35]:
model.predict([[2,9,6]])

/usr/local/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[53205.96797671]])

In [36]:
model.predict([[12,10,10]])

/usr/local/anaconda3/lib/python3.9/site-packages/sklearn/base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[92002.18340611]])